miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_hreg_access.c
/******************************************************************************
 Function Name   : hw_usb_hset_enb_attche
 Description     : Enable the specified port's ATTCHE-interrupt "Connection 
                 : Detection" by setting the ATTCHE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_attche (usb_utr_t *ptr)
{
    ptr->ipp->INTENB1.WORD |= USB_ATTCHE;
}
/******************************************************************************
 End of function hw_usb_hset_enb_attche
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_enb_attche
 Description     : Disable the specified port's ATTCHE-interrupt "Disconnection 
                 : Detection" by clearing the ATTCHE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_enb_attche (usb_utr_t *ptr)
{
    ptr->ipp->INTENB1.WORD &= (~USB_ATTCHE);
}
/******************************************************************************
 End of function hw_usb_hclear_enb_attche
 ******************************************************************************/
 
/******************************************************************************
 Function Name   : hw_usb_hset_enb_signe
 Description     : Enable the SIGNE-interrupt "Setup Transaction
                 : Error" by setting the SIGNE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_signe (usb_utr_t *ptr)
{
    ptr->ipp->INTENB1.WORD |= USB_SIGNE;
}
/******************************************************************************
 End of function hw_usb_hset_enb_signe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_enb_sacke
 Description     : Enable the SACKE-interrupt "Setup Transaction 
                 : Normal Response" by setting the SACKE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_sacke (usb_utr_t *ptr)
{
    ptr->ipp->INTENB1.WORD |= USB_SACKE;
}
/******************************************************************************
 End of function hw_usb_hset_enb_sacke
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_enb_pddetinte
 Description     : Enable the PDDETINT-interrupt "Connection Detection for 
                 : Battery Charging Supporting Device" by setting 
                 : the PDDETINTE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_pddetinte (usb_utr_t *ptr)
{
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if (ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->INTENB1.WORD |= USB_PDDETINTE;

    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
}
/******************************************************************************
 End of function hw_usb_hset_enb_pddetinte
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hwrite_intsts
 Description     : Write the specified data to the specified port's INTSTS1 reg-
                 : ister.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hwrite_intsts (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->INTSTS1.WORD = data;
}
/******************************************************************************
 End of function hw_usb_hwrite_intsts
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_sts_ovrcr
 Description     : Clear the specified port's OVRCR-bit; "Overcurrent 
                 : Input Change Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_ovrcr (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_OVRCR) & INTSTS1_MASK);
}
/******************************************************************************
 End of function hw_usb_hclear_sts_ovrcr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_sts_bchg
 Description     : Clear the specified port's BCHG-bit; "USB Bus Change Interrupt 
                 : Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_bchg (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_BCHG) & INTSTS1_MASK);
} /* End of function hw_usb_hclear_sts_bchg() */
/******************************************************************************
 End of function hw_usb_hclear_sts_bchg
 ******************************************************************************/

