miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_hreg_access.c
/******************************************************************************
 Function Name   : hw_usb_hclear_sts_dtch
 Description     : Clear the specified port's DTCH-bit; "USB Disconnection Detec-
                 : tion Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_dtch (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_DTCH) & INTSTS1_MASK);
}
/******************************************************************************
 End of function hw_usb_hclear_sts_dtch
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_sts_attch
 Description     : Clear the specified port's ATTCH-bit; "ATTCH Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_attch (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_ATTCH) & INTSTS1_MASK);
}
/******************************************************************************
 End of function hw_usb_hclear_sts_attch
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_sts_sign
 Description     : Clear the SIGN-bit; "Setup Transaction Error
                 : Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_sign (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_SIGN) & INTSTS1_MASK);
}
/******************************************************************************
 End of function hw_usb_hclear_sts_sign
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_sts_sack
 Description     : Clear the SACK-bit; "Setup Transaction Normal
                 : Response Interrupt Status".
                 : Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_sack (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_SACK) & INTSTS1_MASK);
}
/******************************************************************************
 End of function hw_usb_hclear_sts_sack
 ******************************************************************************/
 
/******************************************************************************
 Function Name   : hw_usb_hclear_sts_pddetint
 Description     : Clear the PDDETINT-bit; "
                 : ".
                 : Interrupt Status".
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_sts_pddetint (usb_utr_t *ptr)
{
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if (ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->INTSTS1.WORD = (uint16_t) ((~USB_PDDETINT) & INTSTS1_MASK);

    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
}
/******************************************************************************
 End of function hw_usb_hclear_sts_pddetint
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hwrite_usbreq
 Description     : Write bRequest and bmRequestType to USBREQ register.
                 : When Host, the values of bRequest and bmRequestType 
                 : to be transmitted are written. (When Function, the received 
                 : values of bRequest and bmRequestType are stored in USBREQ).
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hwrite_usbreq (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->USBREQ.WORD = data;
}
/******************************************************************************
 End of function hw_usb_hwrite_usbreq
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_usbval
 Description     : Write the specified 'wValue' to USBVAL register,
                 : to write the USB request. When Host, the value of 
                 : wValue to be transmitted is set. (When Function, the value of 
                 : wValue that has been received is stored in USBREQ.)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_usbval (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->USBVAL = data;
}
/******************************************************************************
 End of function hw_usb_hset_usbval
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_usbindx
 Description     : Write the specified 'wIndex', the USB request, to USBINDX
                 : register, for host setup requests for control 
                 : transfers.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_usbindx (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->USBINDX = data;
}
/******************************************************************************
 End of function hw_usb_hset_usbindx
 ******************************************************************************/

