miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_hreg_access.c
/******************************************************************************
 Function Name   : hw_usb_hmodule_init
 Description     : USB module initialization for USB Host mode
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hmodule_init (usb_ctrl_t *p_ctrl)
{
    uint16_t sts;

    if ( USB_IP0 == p_ctrl->module)
    {
        USB_M0.SYSCFG.WORD |= USB_SCKE;
        while ( USB_SCKE != (USB_M0.SYSCFG.WORD & USB_SCKE))
        {
            /* none */
        }

#if defined(BSP_MCU_RX64M)
        USB_M0.PHYSLEW.LONG = 0xE;

#endif  /* defined(BSP_MCU_RX64M) */

#if defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N)
        USB_M0.PHYSLEW.LONG = 0x5;

#endif  /* defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) */

        USB_M0.SYSCFG.WORD |= USB_DCFM;

        USB_M0.SYSCFG.WORD |= USB_DRPD;

        sts = usb_chattaring((uint16_t *) &USB_M0.SYSSTS0.WORD);

        USB_M0.SYSCFG.WORD |= USB_USBE;

        USB_M0.CFIFOSEL.WORD  = USB0_CFIFO_MBW;
        USB_M0.D0FIFOSEL.WORD = USB0_D0FIFO_MBW;
        USB_M0.D1FIFOSEL.WORD = USB0_D1FIFO_MBW;

#if USB_CFG_ENDIAN == USB_CFG_BIG
        USB_M0.CFIFOSEL.WORD |= USB_BIGEND;
        USB_M0.D0FIFOSEL.WORD |= USB_BIGEND;
        USB_M0.D1FIFOSEL.WORD |= USB_BIGEND;

#endif  /* USB_CFG_ENDIAN == USB_CFG_BIG */

        switch (sts)
        {
            case USB_FS_JSTS : /* USB device already connected */
            case USB_LS_JSTS :
                USB_M0.DVSTCTR0.WORD |= USB_USBRST;
                usb_cpu_delay_xms((uint16_t) 50); /* Need to wait greater equal 10ms in USB spec */
                USB_M0.DVSTCTR0.WORD &= (~USB_USBRST);
                while ( USB_HSPROC == (USB_M0.DVSTCTR0.WORD & USB_HSPROC))
                {
                    /* HSPROC = 0100b */
                }

                if ( USB_LSMODE == (USB_M0.DVSTCTR0.WORD & USB_RHST))
                {
                    USB_M0.SOFCFG.WORD |= USB_TRNENSEL;
                }

                USB_M0.DVSTCTR0.WORD |= USB_UACT;
            break;

            case USB_SE0 : /* USB device no connected */
                USB_M0.INTENB1.WORD = USB_ATTCH;
            break;

            default :
            break;
        }
        USB_M0.INTSTS1.WORD &= ((~USB_OVRCRE) & INTSTS1_MASK);
        USB_M0.INTENB0.WORD = ((USB_BEMPE | USB_NRDYE) | USB_BRDYE);
        USB_M0.INTENB1.WORD = (USB_OVRCRE | USB_ATTCH);
    }
#if USB_NUM_USBIP == 2
    else
    {
#if defined(BSP_MCU_RX62N)
        USB_M1.SYSCFG.WORD |= USB_SCKE;
        while ( USB_SCKE != (USB_M1.SYSCFG.WORD & USB_SCKE))
        {
            /* none */
        }
#endif /* defined(BSP_MCU_RX62N) */

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
#if USB_CFG_CLKSEL == USB_CFG_20MHZ
        USB_M1.PHYSET.WORD &= ~USB_CLKSEL;
        USB_M1.PHYSET.WORD |= USB_CLKSEL_20;

#endif  /* USB_CFG_CLKSEL == USB_CFG_20MHZ */

#if USB_CFG_CLKSEL == USB_CFG_OTHER
        USB_M1.PHYSET.WORD |= USB_HSEB;

#else   /* USB_CFG_OTHER == USB_CFG_OTHER */
        USB_M1.PHYSET.WORD |= USB_REPSEL_16;

#endif  /* USB_CFG_OTHER == USB_CFG_OTHER */

        usb_cpu_delay_1us((uint16_t) 1);                    /* wait 1usec */

        USB_M1.PHYSET.WORD &= (~USB_DIRPD);
        usb_cpu_delay_xms(1); /* wait 1msec */

#if ((USB_CFG_CLKSEL == USB_CFG_20MHZ) || (USB_CFG_CLKSEL == USB_CFG_24MHZ))
        USB_M1.PHYSET.WORD &= (~USB_PLLRESET);

#endif  /* (USB_CFG_CLKSEL == USB_CFG_20MHZ) || (USB_CFG_CLKSEL == USB_CFG_24MHZ) */

        USB_M1.LPSTS.WORD |= USB_SUSPENDM;

#if ((USB_CFG_CLKSEL == USB_CFG_20MHZ) || (USB_CFG_CLKSEL == USB_CFG_24MHZ))
        while( USB_PLLLOCK != (USB_M1.PLLSTA.WORD & USB_PLLLOCK ) )
        {
            /* Wait for PLL Lock */
        };

#endif  /* (USB_CFG_CLKSEL == USB_CFG_20MHZ) || (USB_CFG_CLKSEL == USB_CFG_24MHZ) */

        USB_M1.SYSCFG.WORD |= USB_DRPD;

        USB_M1.SYSCFG.WORD |= USB_CNEN;

        USB_M1.BUSWAIT.WORD = (USB_CFG_BUSWAIT | 0x0F00);
        usb_cpu_delay_1us((uint16_t) 1);                    /* wait 1usec */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

        USB_M1.SOFCFG.WORD |= USB_INTL;

        USB_M1.SYSCFG.WORD |= USB_DCFM;

#if defined(BSP_MCU_RX62N)
        USB_M1.SYSCFG.WORD |= USB_DRPD;
#endif /* defined(BSP_MCU_RX62N) */

        sts = usb_chattaring( (uint16_t *)&USB_M1.SYSCFG.WORD );

        USB_M1.SYSCFG.WORD |= USB_USBE;

        USB_M1.CFIFOSEL.WORD  = USB1_CFIFO_MBW;
        USB_M1.D0FIFOSEL.WORD = USB1_D0FIFO_MBW;
        USB_M1.D1FIFOSEL.WORD = USB1_D1FIFO_MBW;

#if USB_CFG_ENDIAN ==USB_CFG_BIG
        USB_M1.CFIFOSEL.WORD |= USB_BIGEND;
        USB_M1.D0FIFOSEL.WORD |= USB_BIGEND;
        USB_M1.D1FIFOSEL.WORD |= USB_BIGEND;
#endif
        switch( sts )
        {
            case USB_FS_JSTS: /* USB device already connected */
            case USB_LS_JSTS:
                if (USB_FS_JSTS == sts)
                {
                    USB_M1.SYSCFG.WORD |= USB_HSE;
                }

                USB_M1.DVSTCTR0.WORD |= USB_USBRST;

                usb_cpu_delay_xms((uint16_t)50); /* Need to wait greater equal 10ms in USB spec */

                USB_M1.DVSTCTR0.WORD &= (~USB_USBRST);
                while (USB_HSPROC == (USB_M1.DVSTCTR0.WORD & USB_HSPROC))
                {
                    /* Wait for USB reset handshake in progress */
                };

                if (USB_LSMODE == (USB_M1.DVSTCTR0.WORD & USB_RHST))
                {
                    USB_M1.SOFCFG.WORD |= USB_TRNENSEL;
                }

                USB_M1.DVSTCTR0.WORD |= USB_UACT;
            break;
            case USB_SE0: /* USB device no connected */
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX62N)
                USB_M1.INTENB1.WORD = USB_ATTCH;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX62N) */
            break;
            default:
            break;
        }
        USB_M1.INTSTS1.WORD &= (~USB_OVRCRE & INTSTS1_MASK);
        USB_M1.INTENB0.WORD = (USB_BEMPE | USB_NRDYE | USB_BRDYE);
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        USB_M1.INTENB1.WORD = (USB_OVRCRE | USB_ATTCH);

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }
#endif /* USB_NUM_USBIP == 2 */
}
/******************************************************************************
 End of function hw_usb_hmodule_init
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_trnensel
 Description     : When host, set the TRNENSEL-bit; "Transac-
                 : tion-Enabled Time Select" for low-speed USB communication.
                 : This bit should be set to 0 if USB Function.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_trnensel (usb_utr_t *ptr)
{
    ptr->ipp->SOFCFG.WORD |= USB_TRNENSEL;
}
/******************************************************************************
 End of function hw_usb_hset_trnensel
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End of file
 ******************************************************************************/
